[Survived] BlockStatement
src/functions.js:16:27
 //     return num1;
 // }
 
-function blockStatement1(){
-    console.log("Block1");
-}
+function blockStatement1(){}
 
 // function blockStatement2(){

[Killed] BlockStatement
src/functions.js:40:20
 //     }
 // }
 
-function runLoop(a){
-  let c = 0;
-  for(let i = 0; i< a; i++){
-    blockStatement1()
-    c++;
-  }
-  return {
-    name: 'runLoop',
-    count: c
-  }
-}
+function runLoop(a){}
 
 
killedBy: tests Should run loop 10 times
statusReason: Cannot read properties of undefined (reading 'count')

[Killed] EqualityOperator
src/functions.js:42:18
 
 function runLoop(a){
   let c = 0;
-  for(let i = 0; i< a; i++){
+  for(let i = 0; i >= a; i++){
     blockStatement1()
     c++;
killedBy: tests Should run loop 10 times
statusReason: expected +0 to equal 10

[Killed] ConditionalExpression
src/functions.js:42:18
 
 function runLoop(a){
   let c = 0;
-  for(let i = 0; i< a; i++){
+  for(let i = 0; false; i++){
     blockStatement1()
     c++;
killedBy: tests Should run loop 10 times
statusReason: expected +0 to equal 10

[Killed] UpdateOperator
src/functions.js:44:5
   let c = 0;
   for(let i = 0; i< a; i++){
     blockStatement1()
-    c++;
+    c--;
   }
   return {
killedBy: tests Should run loop 10 times
statusReason: expected -10 to equal 10

[Killed] ObjectLiteral
src/functions.js:46:10
     blockStatement1()
     c++;
   }
-  return {
-    name: 'runLoop',
-    count: c
-  }
+  return {}
 }
 
killedBy: tests Should run loop 10 times
statusReason: expected undefined to equal 10

[Killed] ObjectLiteral
src/functions.js:53:18
 }
 
 
-module.exports = {
-    add,
-    getArray,
-
-    blockStatement1,
-
-    runLoop,
-}
+module.exports = {}
killedBy: tests Should add two numbers fail
statusReason: add is not a function
