[Survived] BlockStatement
src/functions.js:1:25
-function add(num1, num2){
-    return num1+num2;
-}
+function add(num1, num2){}
 
 function getArray(){

[Survived] ArithmeticOperator
src/functions.js:2:12
 function add(num1, num2){
-    return num1+num2;
+    return num1 - num2;
 }
 

[Killed] BlockStatement
src/functions.js:5:20
     return num1+num2;
 }
 
-function getArray(){
-    const array = [1,2,3]
-    return array
-}
+function getArray(){}
 
 module.exports = {
killedBy: tests Should get Arrays
statusReason: expected undefined to deeply equal [ 1, 2, 3 ]
